In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("D:/Datasets/titanic_comp.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.shape

(891, 12)

In [6]:
df["Age"].fillna(df["Age"].mean(),inplace=True)

In [7]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df.shape

(891, 12)

In [9]:
df.drop("Cabin",axis=1,inplace=True)

In [11]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [17]:
df["Embarked"].fillna(df["Embarked"].mode()[0],inplace=True)

In [16]:
df["Embarked"].mode()[0]

'S'

In [18]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [20]:
y=df["Survived"]

In [21]:
X=df.drop(["Survived","PassengerId","Name","Ticket","Embarked"],axis=1)

In [22]:
X

     Pclass     Sex        Age  SibSp  Parch     Fare
0         3    male  22.000000      1      0   7.2500
1         1  female  38.000000      1      0  71.2833
2         3  female  26.000000      0      0   7.9250
3         1  female  35.000000      1      0  53.1000
4         3    male  35.000000      0      0   8.0500
..      ...     ...        ...    ...    ...      ...
886       2    male  27.000000      0      0  13.0000
887       1  female  19.000000      0      0  30.0000
888       3  female  29.699118      1      2  23.4500
889       1    male  26.000000      0      0  30.0000
890       3    male  32.000000      0      0   7.7500

[891 rows x 6 columns]

In [24]:
X=pd.get_dummies(X,columns=["Sex"])

In [25]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_female  Sex_male
0       3  22.0      1      0   7.2500           0         1
1       1  38.0      1      0  71.2833           1         0
2       3  26.0      0      0   7.9250           1         0
3       1  35.0      1      0  53.1000           1         0
4       3  35.0      0      0   8.0500           0         1

In [26]:
import keras
from keras.layers import Dense
from keras.models import Sequential
from keras.utils import to_categorical

In [30]:
target=to_categorical(y)

In [55]:
target

array([[1., 0.],
       [0., 1.],
       [0., 1.],
       ...,
       [1., 0.],
       [0., 1.],
       [1., 0.]], dtype=float32)

In [47]:
model=Sequential()
model.add(Dense(1500,activation="relu",input_shape=(7,)))
model.add(Dense(1000,activation="relu"))
model.add(Dense(1000,activation="relu"))

model.add(Dense(800,activation="relu"))
model.add(Dense(700,activation="relu"))
model.add(Dense(2,activation="softmax"))

In [48]:
model.compile(optimizer="adam",loss="categorical_crossentropy",metrics=["accuracy"])

In [50]:
model.fit(X,target,epochs=20)

Epoch 1/20
28/28 [==============================] - 1s 43ms/step - loss: 0.4920 - accuracy: 0.7991
Epoch 2/20
28/28 [==============================] - 1s 48ms/step - loss: 0.4618 - accuracy: 0.8103
Epoch 3/20
28/28 [==============================] - 1s 45ms/step - loss: 0.4529 - accuracy: 0.8092
Epoch 4/20
28/28 [==============================] - 1s 49ms/step - loss: 0.4514 - accuracy: 0.7980
Epoch 5/20
28/28 [==============================] - 1s 40ms/step - loss: 0.4279 - accuracy: 0.8171
Epoch 6/20
28/28 [==============================] - 1s 41ms/step - loss: 0.4244 - accuracy: 0.8204
Epoch 7/20
28/28 [==============================] - 1s 39ms/step - loss: 0.4873 - accuracy: 0.7800
Epoch 8/20
28/28 [==============================] - 1s 45ms/step - loss: 0.5034 - accuracy: 0.8047
Epoch 9/20
28/28 [==============================] - 1s 43ms/step - loss: 0.4529 - accuracy: 0.8070
Epoch 10/20
28/28 [==============================] - 1s 48ms/step - loss: 0.4497 - accuracy: 0.8272
Epoch 11/20
28/28 [==============================] - 1s 41ms/step - loss: 0.4381 - accuracy: 0.7935
Epoch 12/20
28/28 [==============================] - 1s 43ms/step - loss: 0.4349 - accuracy: 0.8081
Epoch 13/20
28/28 [==============================] - 1s 50ms/step - loss: 0.4303 - accuracy: 0.8227
Epoch 14/20
28/28 [==============================] - 1s 42ms/step - loss: 0.4390 - accuracy: 0.7980
Epoch 15/20
28/28 [==============================] - 1s 40ms/step - loss: 0.4183 - accuracy: 0.8013
Epoch 16/20
28/28 [==============================] - 1s 40ms/step - loss: 0.4157 - accuracy: 0.8260
Epoch 17/20
28/28 [==============================] - 1s 41ms/step - loss: 0.4073 - accuracy: 0.8193
Epoch 18/20
28/28 [==============================] - 1s 41ms/step - loss: 0.4225 - accuracy: 0.8260
Epoch 19/20
28/28 [==============================] - 1s 47ms/step - loss: 0.4188 - accuracy: 0.8092
Epoch 20/20
28/28 [==============================] - 1s 41ms/step - loss: 0.4269 - accuracy: 0.8137

In [51]:
X

     Pclass        Age  SibSp  Parch     Fare  Sex_female  Sex_male
0         3  22.000000      1      0   7.2500           0         1
1         1  38.000000      1      0  71.2833           1         0
2         3  26.000000      0      0   7.9250           1         0
3         1  35.000000      1      0  53.1000           1         0
4         3  35.000000      0      0   8.0500           0         1
..      ...        ...    ...    ...      ...         ...       ...
886       2  27.000000      0      0  13.0000           0         1
887       1  19.000000      0      0  30.0000           1         0
888       3  29.699118      1      2  23.4500           1         0
889       1  26.000000      0      0  30.0000           0         1
890       3  32.000000      0      0   7.7500           0         1

[891 rows x 7 columns]

In [53]:
data=pd.DataFrame({"Pclass":[1],"Age":[23],"Sibsp":[2],"Parch":[2],"Fare":[70],"Sex_female":[1],"Sex_male":[0]})

In [54]:

data.shape

(1, 7)

In [56]:
model.predict(data)

array([[0.25621712, 0.7437829 ]], dtype=float32)